{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_layout_transform", 
      "attrs": {
        "dst_layout": "NCHW3c", 
        "src_layout": "NCHW", 
        "num_outputs": "1", 
        "hash": "453f05448615bf7d", 
        "func_name": "tvmgen_default_fused_add_layout_transform", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "3a357f8d685a576a", 
        "kernel_layout": "OIHW3i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW3c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_multiply_add_nn_relu", 
      "attrs": {
        "layout": "NCHW32c", 
        "hash": "17014770009f9745", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_add_nn_relu", 
        "flatten_data": "0", 
        "out_layout": "", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "dst_layout": "NCHW16c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "edc0451b9bdd87f9", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
      "attrs": {
        "out_layout": "NCHW16c", 
        "flatten_data": "0", 
        "hash": "d8cfbc10907097c7", 
        "kernel_layout": "OIHW16i16o", 
        "num_outputs": "1", 
        "data_layout": "NCHW16c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1", 
      "attrs": {
        "dst_layout": "NCHW64c", 
        "src_layout": "NCHW16c", 
        "num_outputs": "1", 
        "hash": "5c51186f3d0cb5ba", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "7aae07a99ac2073e", 
        "kernel_layout": "OIHW64i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW64c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "3059585007cc4cd9", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2_1", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "3059585007cc4cd9", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "0e6135c109b99271", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "223d95fd4ffac48a", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform", 
      "attrs": {
        "dst_layout": "NCHW256c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "f84468ef18920e09", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "10453485b355525e", 
        "kernel_layout": "OIHW256i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW256c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3", 
      "attrs": {
        "dst_layout": "NCHW64c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "58835064872ff1c7", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2_1", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "7aae07a99ac2073e", 
        "kernel_layout": "OIHW64i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW64c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2_2", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "3059585007cc4cd9", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "223d95fd4ffac48a", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_1", 
      "attrs": {
        "dst_layout": "NCHW256c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "f84468ef18920e09", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3_1", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "10453485b355525e", 
        "kernel_layout": "OIHW256i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW256c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3_1", 
      "attrs": {
        "dst_layout": "NCHW64c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "58835064872ff1c7", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2_2", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "7aae07a99ac2073e", 
        "kernel_layout": "OIHW64i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW64c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2_3", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "3059585007cc4cd9", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "68c3b45d91ba6815", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "num_inputs": "4"
      }, 
      "inputs": [
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "80ac488b069cdcfc", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
      "attrs": {
        "out_layout": "NCHW4c", 
        "flatten_data": "0", 
        "hash": "66610aa5e7c24d8b", 
        "kernel_layout": "OIHW4i4o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
      "attrs": {
        "out_layout": "NCHW4c", 
        "flatten_data": "0", 
        "hash": "6f19a92fbf81208b", 
        "kernel_layout": "OIHW4i4o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5", 
      "attrs": {
        "dst_layout": "NCHW256c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "1d8932364575f6fc", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_1", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "af3f22dfb0bf6f74", 
        "kernel_layout": "OIHW256i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW256c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_1", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_6", 
      "attrs": {
        "dst_layout": "NCHW32c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "03f38845b960b993", 
        "func_name": "tvmgen_default_fused_layout_transform_6", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1_1", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "72687c198728b92b", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_1_1", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "33f790dda0c7f70f", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_1", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "54aa06c2ac9db72c", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_7", 
      "attrs": {
        "dst_layout": "NCHW128c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "363391dca7301378", 
        "func_name": "tvmgen_default_fused_layout_transform_7", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "88c81214697c09b4", 
        "kernel_layout": "OIHW128i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW128c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_8", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "b4041702065acf0e", 
        "func_name": "tvmgen_default_fused_layout_transform_8", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1_2", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "72687c198728b92b", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_1_2", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "33f790dda0c7f70f", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_1", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6_1", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "54aa06c2ac9db72c", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_7_1", 
      "attrs": {
        "dst_layout": "NCHW128c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "363391dca7301378", 
        "func_name": "tvmgen_default_fused_layout_transform_7", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7_1", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "88c81214697c09b4", 
        "kernel_layout": "OIHW128i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW128c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_8_1", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "b4041702065acf0e", 
        "func_name": "tvmgen_default_fused_layout_transform_8", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1_3", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "72687c198728b92b", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_1_3", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "33f790dda0c7f70f", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_1", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6_2", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "54aa06c2ac9db72c", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_7_2", 
      "attrs": {
        "dst_layout": "NCHW128c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "363391dca7301378", 
        "func_name": "tvmgen_default_fused_layout_transform_7", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          89, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7_2", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "88c81214697c09b4", 
        "kernel_layout": "OIHW128i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW128c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_8_2", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "b4041702065acf0e", 
        "func_name": "tvmgen_default_fused_layout_transform_8", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
      "attrs": {
        "out_layout": "NCHW32c", 
        "flatten_data": "0", 
        "hash": "d3e48b56761391f6", 
        "kernel_layout": "OIHW4i32o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
        "num_inputs": "4"
      }, 
      "inputs": [
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_9", 
      "attrs": {
        "dst_layout": "NCHW4c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "efa309af424f5252", 
        "func_name": "tvmgen_default_fused_layout_transform_9", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_8", 
      "attrs": {
        "out_layout": "NCHW4c", 
        "flatten_data": "0", 
        "hash": "9545af7f0df7bed9", 
        "kernel_layout": "OIHW4i4o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_8", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_9", 
      "attrs": {
        "out_layout": "NCHW4c", 
        "flatten_data": "0", 
        "hash": "8c6fd62c9464a711", 
        "kernel_layout": "OIHW4i4o", 
        "num_outputs": "1", 
        "data_layout": "NCHW4c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_9", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_10", 
      "attrs": {
        "dst_layout": "NCHW256c", 
        "src_layout": "NCHW4c", 
        "num_outputs": "1", 
        "hash": "727d4aa57e53ad43", 
        "func_name": "tvmgen_default_fused_layout_transform_10", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          104, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_11", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW32c", 
        "num_outputs": "1", 
        "hash": "d9619a4ccc0248b5", 
        "func_name": "tvmgen_default_fused_layout_transform_11", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_2", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "90f5dcd27dd89ac4", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_2", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "5d99a15060f82fa0", 
        "kernel_layout": "OIHW256i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW256c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          105, 
          0, 
          0
        ], 
        [
          106, 
          0, 
          0
        ], 
        [
          109, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_2", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "ec296f37af9ccf9e", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "dd7b81716a7288fc", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_12", 
      "attrs": {
        "dst_layout": "NCHW128c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "5c44374e09dd10ac", 
        "func_name": "tvmgen_default_fused_layout_transform_12", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          115, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11", 
      "attrs": {
        "out_layout": "NCHW16c", 
        "flatten_data": "0", 
        "hash": "4ae2b1b055da5201", 
        "kernel_layout": "OIHW128i16o", 
        "num_outputs": "1", 
        "data_layout": "NCHW128c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          116, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ], 
        [
          118, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_13", 
      "attrs": {
        "dst_layout": "NCHW256c", 
        "src_layout": "NCHW16c", 
        "num_outputs": "1", 
        "hash": "e7ef63554b4590b1", 
        "func_name": "tvmgen_default_fused_layout_transform_13", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          119, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2_1", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "5d99a15060f82fa0", 
        "kernel_layout": "OIHW256i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW256c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          120, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_2_1", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "ec296f37af9ccf9e", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          122, 
          0, 
          0
        ], 
        [
          123, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10_1", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "dd7b81716a7288fc", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          124, 
          0, 
          0
        ], 
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_12_1", 
      "attrs": {
        "dst_layout": "NCHW128c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "5c44374e09dd10ac", 
        "func_name": "tvmgen_default_fused_layout_transform_12", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          127, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11_1", 
      "attrs": {
        "out_layout": "NCHW16c", 
        "flatten_data": "0", 
        "hash": "4ae2b1b055da5201", 
        "kernel_layout": "OIHW128i16o", 
        "num_outputs": "1", 
        "data_layout": "NCHW128c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          128, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_13_1", 
      "attrs": {
        "dst_layout": "NCHW256c", 
        "src_layout": "NCHW16c", 
        "num_outputs": "1", 
        "hash": "e7ef63554b4590b1", 
        "func_name": "tvmgen_default_fused_layout_transform_13", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          131, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2_2", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "5d99a15060f82fa0", 
        "kernel_layout": "OIHW256i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW256c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          132, 
          0, 
          0
        ], 
        [
          133, 
          0, 
          0
        ], 
        [
          122, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_2_2", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "ec296f37af9ccf9e", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10_2", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "dd7b81716a7288fc", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          136, 
          0, 
          0
        ], 
        [
          137, 
          0, 
          0
        ], 
        [
          138, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_12_2", 
      "attrs": {
        "dst_layout": "NCHW128c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "5c44374e09dd10ac", 
        "func_name": "tvmgen_default_fused_layout_transform_12", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          139, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11_2", 
      "attrs": {
        "out_layout": "NCHW16c", 
        "flatten_data": "0", 
        "hash": "4ae2b1b055da5201", 
        "kernel_layout": "OIHW128i16o", 
        "num_outputs": "1", 
        "data_layout": "NCHW128c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          140, 
          0, 
          0
        ], 
        [
          141, 
          0, 
          0
        ], 
        [
          142, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_13_2", 
      "attrs": {
        "dst_layout": "NCHW256c", 
        "src_layout": "NCHW16c", 
        "num_outputs": "1", 
        "hash": "e7ef63554b4590b1", 
        "func_name": "tvmgen_default_fused_layout_transform_13", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          143, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2_3", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "5d99a15060f82fa0", 
        "kernel_layout": "OIHW256i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW256c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          144, 
          0, 
          0
        ], 
        [
          145, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_2_3", 
      "attrs": {
        "dst_layout": "NCHW512c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "ec296f37af9ccf9e", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_2", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          146, 
          0, 
          0
        ], 
        [
          147, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10_3", 
      "attrs": {
        "out_layout": "NCHW64c", 
        "flatten_data": "0", 
        "hash": "dd7b81716a7288fc", 
        "kernel_layout": "OIHW512i64o", 
        "num_outputs": "1", 
        "data_layout": "NCHW512c", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          148, 
          0, 
          0
        ], 
        [
          149, 
          0, 
          0
        ], 
        [
          150, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_12_3", 
      "attrs": {
        "dst_layout": "NCHW128c", 
        "src_layout": "NCHW64c", 
        "num_outputs": "1", 
        "hash": "5c44374e09dd10ac", 
        "func_name": "tvmgen_default_fused_layout_transform_12", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
